In [2]:
import pandas as pd
pd.set_option('display.max_columns', 10)
print("Original data set from Excel file:\n")
df=pd.read_excel("dcap.xlsx")
print(df)

Original data set from Excel file:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49      NaN      49    237

In [14]:
f=df['NAME'].str.strip()

#f.to_excel("sample22.xlsx")
print(f)

0      DEEPA
1     DINESH
2     KAVIYA
3    RACHEAL
4      RAJAN
5      RAMYA
6      ROHAN
7     ROHINI
8    SANDHYA
9    SARANYA
Name: NAME, dtype: object

In [18]:
print("\nReplace value with Forward:\n")
k=df.fillna(method='pad')
print(k)
print("\nThe above updated data set will be stored in sample2.xlsx file....\n")
k.to_excel("sample2.xlsx")

Replace value with Forward:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN     89.0     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49     56.0      49    237

The above updated data set will be stored in sample2.xlsx file....

C:\Users\Tcs\AppData\Local\Temp\ipykernel_4904\1888627935.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='pad')

In [28]:
print("\nDrop one particular column and its values:\n")
k.drop(['NAME'],axis=1, inplace=True)
print(k)
print("\nThe above updated data set will be stored in sample3.xlsx file....\n")
k.to_excel("sample3.xlsx")

Drop one particular column and its values:

   ROLL  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL
0   101     50.0     67     50     67.0      50
1   102     56.0     89     56     89.0      56
2   103     80.0     80     80     80.0      80
3   104     89.0     87     89     87.0      89
4   105     89.0     98     90     98.0      90
5   106     67.0     76     67     76.0      67
6   107     56.0     67     56     67.0      56
7   108     57.0     65     57     65.0      57
8   109     58.0     56     58     56.0      58
9   110     49.0     45     49     56.0      49

The above updated data set will be stored in sample3.xlsx file....

In [32]:
print("\nDrop NaN rows:\n")
df=pd.read_excel("dcap.xlsx")
print(df)
x=df.dropna()
print(x)
print("\nThe above updated data set will be stored in sample5.xlsx file....\n")
x.to_excel("sample5.xlsx")

Drop NaN rows:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49      NaN      49    237
   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286

The above updated data set will be stored in sample5.xlsx file....

In [34]:
print("\nReplace values:\n")
n=pd.read_excel("dcap.xlsx")
print("Original data set:\n");
print(n)
y=n.replace({49:50})
print("\nUpdated dataset with replaced values: {49:50}\n")
print(y)
print("\nThe above updated data set will be stored in sample6.xlsx file....\n")
y.to_excel("sample6.xlsx")

Replace values:

Original data set:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49      NaN      49    237

Updated dataset with replaced values: {49:50}

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     50.0     45     50      NaN      50    237

The above updated data set will be stored in sample6.xlsx file....

In [38]:
print("Original data set from Excel file:\n")
df=pd.read_excel("dcap.xlsx")
print(df)

print("\nExtract the particular record based’on the isin() function condition:\n")
new=df['ENGLISH'].isin([49])
print(df[new])

Original data set from Excel file:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49      NaN      49    237

Extract the particular record based’on the isin() function condition:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
9   110  SARANYA     49.0     45     49      NaN      49    237